In [51]:
#basic practise on pandas
import pandas as pd
from pathlib import Path
#print(Path.cwd())
data = pd.read_csv('/home/navneet/Documents/ANOVA/PlantGrowth.csv')
#print(data.info)     
#print(data.columns)
#print(data.index)
#print(data.values)
w=data['weight']  #access only one column
print(type(w))    #to know the type of accesing col it is series type
data1=data.set_index('sr')  #set one of the column into index
data1.head()

<class 'pandas.core.series.Series'>

    weight group
sr
1     4.17  ctrl
2     5.58  ctrl
3     5.18  ctrl
4     6.11  ctrl
5     4.50  ctrl

In [30]:
data["weight"][:3]   #access the wieght col upto 3 row

sr
1    4.17
2    5.58
3    5.18
Name: weight, dtype: float64

In [41]:
data["group"][:6]  #access the group col upto 6 row

0    ctrl
1    ctrl
2    ctrl
3    ctrl
4    ctrl
5    ctrl
Name: group, dtype: object

In [42]:
group=data["group"]   #access the another col group
group[2]          #acccess the value on col[row]

'ctrl'

In [45]:
w.describe()    #it calculate all the calculation mean,std,count,min,max etc

count    30.000000
mean      5.073000
std       0.701192
min       3.590000
25%       4.550000
50%       5.155000
75%       5.530000
max       6.310000
Name: weight, dtype: float64

In [56]:
data[['weight','group']][:3]  #access the multiple column we put  upto 7[ [ ] ]

   weight group
0    4.17  ctrl
1    5.58  ctrl
2    5.18  ctrl

In [62]:
#how to obtain lie(row) in pandas
#if we put data[0]  it gives error to handek row we have a iloc and loc 
row3=data.iloc[3] #access the 3rd row from the table
row1_5=data.iloc[1:5]   #row from 1 to 5
print(row1_5)

   sr  weight group
1   2    5.58  ctrl
2   3    5.18  ctrl
3   4    6.11  ctrl
4   5    4.50  ctrl

In [64]:
row_col=data.iloc[ 1:4 , 0:2 ]  #[1:4] for row no. and [0:2] for col no.
row_col

   sr  weight
1   2    5.58
2   3    5.18
3   4    6.11

In [65]:
#Editing row & col index firs you access the row and col
data.head()

   sr  weight group
0   1    4.17  ctrl
1   2    5.58  ctrl
2   3    5.18  ctrl
3   4    6.11  ctrl
4   5    4.50  ctrl

In [70]:
g_index = data.set_index('group')  #change the index of the table or col into index
g_index.head()

       sr  weight
group
ctrl    1    4.17
ctrl    2    5.58
ctrl    3    5.18
ctrl    4    6.11
ctrl    5    4.50

In [73]:
g_index.loc['ctrl'][:3]   #if you make a col into index and this index is (non numeric) form use loc 
                         #to access the perticular row

       sr  weight
group
ctrl    1    4.17
ctrl    2    5.58
ctrl    3    5.18

In [76]:
g_index.loc['ctrl', 'weight']     #access the perticular row(value) with col value

group
ctrl    4.17
ctrl    5.58
ctrl    5.18
ctrl    6.11
ctrl    4.50
ctrl    4.61
ctrl    5.17
ctrl    4.53
ctrl    5.33
ctrl    5.14
Name: weight, dtype: float64

In [80]:
#now ones you access the row or col you can now edit
g_index.loc['ctrl','sr']=6    #here all vule change to 6
g_index[:3]

       sr  weight
group
ctrl    6    4.17
ctrl    6    5.58
ctrl    6    5.18

In [83]:
data[data['sr']>25]   #we can use boolean to go to the index(access the index)

    sr  weight group
25  26    5.29  trt2
26  27    4.92  trt2
27  28    6.15  trt2
28  29    5.80  trt2
29  30    5.26  trt2

In [103]:
g_index.loc[g_index['weight'] < 5.28,"weight"][:3] #access the index ctrl and col wieght > 5.28 values only weight col

group
ctrl    4.17
ctrl    5.18
ctrl    4.50
Name: weight, dtype: float64

In [104]:
#now you can perform calculation on it
g_index.loc[g_index['weight'] < 5.28,"weight"].mean()

4.628333333333335

In [100]:
g_index.loc[g_index['weight'] < 5.28,"weight"].sum()

83.31

In [102]:
g_index.loc[g_index['weight'] > 5.28,"weight"].count()

12

In [105]:
#### now indexing is over now we discus about grouping
#GROUPING
data.head()

   sr  weight group
0   1    4.17  ctrl
1   2    5.58  ctrl
2   3    5.18  ctrl
3   4    6.11  ctrl
4   5    4.50  ctrl

In [182]:
group = data.set_index('group')[:]    
group.head()

       sr  weight
group
ctrl    1    4.17
ctrl    2    5.58
ctrl    3    5.18
ctrl    4    6.11
ctrl    5    4.50

In [164]:
g2=group.groupby('group').count()   #count the no. of item into group wise
print(g2)

       sr  weight
group
ctrl   10      10
trt1   10      10
trt2   10      10

In [160]:
g3=data.groupby('group').count()
print(g3)

       sr  weight
group
ctrl   10      10
trt1   10      10
trt2   10      10

In [177]:
newdata=pd.DataFrame({'sex': ['m','m','f','f','m','m','m','f'],'age': [23,24,23,21,22,21,21,21]})
newdata

  sex  age
0   m   23
1   m   24
2   f   23
3   f   21
4   m   22
5   m   21
6   m   21
7   f   21

In [180]:
g1=newdata.groupby("sex").count()
g1

     age
sex
f      3
m      5

In [181]:
g3=newdata.groupby('sex')['age'].count()
g3

sex
f    3
m    5
Name: age, dtype: int64

In [185]:
g4=data.groupby('group').mean()
g4

         sr  weight
group
ctrl    5.5   5.032
trt1   15.5   4.661
trt2   25.5   5.526

In [192]:
group.head()

       sr  weight
group
ctrl    1    4.17
ctrl    2    5.58
ctrl    3    5.18
ctrl    4    6.11
ctrl    5    4.50

In [196]:
sumofallcol=group.sum()    #group data with group index
sumofallcol

sr        465.00
weight    152.19
dtype: float64

In [201]:
data['group'].value_counts()

trt2    10
trt1    10
ctrl    10
Name: group, dtype: int64

In [206]:
newdata['age'].value_counts(ascending=True)

24    1
22    1
23    2
21    4
Name: age, dtype: int64

In [212]:
l1=[20,31,32]
idx=['a','b','c']
s1=pd.Series(data=l1,index=idx)
s1.head()

a    20
b    31
c    32
dtype: int64

In [213]:
s1[1]   #index wise value

31

In [214]:
s1[:2]

a    20
b    31
dtype: int64

In [215]:
s1.loc['a']   #loc row value (non numeric type)

20

In [216]:
s1.iloc[1]   #numeric type index

31

In [222]:
#copy

s2=s1.copy()
s2

a    20
b    31
c    19
dtype: int64

In [223]:
s2.iloc[2]=19
s2

a    20
b    31
c    19
dtype: int64

In [225]:
s2.loc['a']=13
s2

a    13
b    31
c    19
dtype: int64

In [227]:
s2.replace(to_replace = 31, value = 18, inplace = True)
s2

a    13
b    18
c    19
dtype: int64

In [228]:
s2.index

Index(['a', 'b', 'c'], dtype='object')

In [238]:
s2.rename(index={"a":"y"})

y    13
b    18
c    19
dtype: int64

In [240]:
#add row into series
#crete a another series
s3=pd.Series([7,3],index=['x1','x2'])

In [241]:
s2=s2.append(s3)

In [242]:
s2

a     13
b     18
c     19
x1     7
x2     3
dtype: int64

In [247]:
s2.append(s3, ignore_index = True)   #it will ignore the index(if its ture)

0    13
1    18
2    19
3     7
4     3
5     7
6     3
dtype: int64

In [248]:
s3

x1    7
x2    3
dtype: int64

In [254]:
#to delet the value from series
del s3['x1']
s3

x2    3
dtype: int64

In [258]:
#delete 
s3.drop('x2')

Series([], dtype: int64)

In [259]:
s3

x2    3
dtype: int64

In [262]:
s3.drop(['x2'], inplace = True)

In [263]:
s3

Series([], dtype: int64)

In [268]:
#modification in  DataFrame

l1=[[1,2,3,4],[5,6,7,8],[1,2,3,4]]      #this is value which is in row 
row_idx=["a","b","c"]
col=["x1","x2","x3","x4",]
data1=pd.DataFrame(data=l1, index=row_idx, columns=col)
data1

   x1  x2  x3  x4
a   1   2   3   4
b   5   6   7   8
c   1   2   3   4

In [269]:
data1["x1"]   #access col data

a    1
b    5
c    1
Name: x1, dtype: int64

In [270]:
data1.iloc[0]   #access row data with numeric

x1    1
x2    2
x3    3
x4    4
Name: a, dtype: int64

In [272]:
data1.loc['b']   #access row data with non numeric

x1    5
x2    6
x3    7
x4    8
Name: b, dtype: int64

In [275]:
#editing the value

data1.loc["a"]["x2"]=100
data1

   x1   x2  x3  x4
a   1  100   3   4
b   5    6   7   8
c   1    2   3   4

In [301]:
data1.loc["e"]=[10,11,12]   # add a row in dataframe
data1

   x1  x3  x4
a   1   3   4
b   5   7   8
c   1   3   4
e  10  11  12

In [302]:
data1=data1.drop(["e"])   #delete row
data1

   x1  x3  x4
a   1   3   4
b   5   7   8
c   1   3   4

In [303]:
del data1["x1"]    #delete col

In [304]:
data1

   x3  x4
a   3   4
b   7   8
c   3   4